tutorials/rigidBodyAndBeam_compareSixDoF_Eigen/0/beam/CDQDK
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceTensorField;
    location    "2";
    object      CDQDK;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 0 0 0);

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    right
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    beam
    {
        type            empty;
        value           nonuniform List<tensor> 0();
    }
}


// ************************************************************************* //
