tutorials/rigidBodyAndBeam_compareSixDoF_Eigen/0/beam/CMQTheta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceTensorField;
    location    "2";
    object      CMQTheta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -2 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<tensor> 
59
(
(-6.544e-09 1.2068e-20 -0.000157045 1.3628e-20 -3.76991 -5.69732e-25 -0.000157091 -5.04897e-25 -3.76991)
(-6.05239e-09 -6.2703e-21 -0.000151067 -7.08157e-21 -3.76991 4.2785e-25 -0.000151039 3.95295e-25 -3.76991)
(-5.6555e-09 4.64629e-21 -0.000146008 5.24659e-21 -3.76991 -3.42537e-25 -0.000146025 -3.19309e-25 -3.76991)
(-5.22837e-09 -1.9093e-21 -0.000140399 -2.15666e-21 -3.76991 4.09928e-26 -0.000140389 3.17762e-26 -3.76991)
(-4.8431e-09 1.59698e-21 -0.000135119 1.803e-21 -3.76991 1.65623e-26 -0.000135125 2.39461e-26 -3.76991)
(-4.45813e-09 -4.42515e-22 -0.000129643 -5.00217e-22 -3.76991 9.37269e-26 -0.000129639 9.17424e-26 -3.76991)
(-4.09738e-09 4.46762e-22 -0.000124284 5.04049e-22 -3.76991 -3.43234e-25 -0.000124286 -3.41349e-25 -3.76991)
(-3.7471e-09 -2.96638e-22 -0.000118855 -3.35477e-22 -3.76991 -6.29609e-26 -0.000118853 -6.41874e-26 -3.76991)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-6.91408e-09 1.50796e-13 -0.000161487 -2.16351e-20 -3.76991 9.42193e-25 -0.000161409 -6.45637e-18 -3.76991);
    }
    right
    {
        type            calculated;
        value           uniform (-6.91486e-09 -1.50796e-13 0.000161505 2.09772e-20 -3.77034 9.14818e-25 0.000161427 -6.45637e-18 -3.77034);
    }
    beam
    {
        type            empty;
        value           nonuniform List<tensor> 0();
    }
}


// ************************************************************************* //
