tutorials/rigidBodyAndBeam_compareSixDoF_Eigen/0/beam/CMTheta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceTensorField;
    location    "2";
    object      CMTheta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 3 -2 0 0 0 0];

internalField   nonuniform List<tensor> 
59
(
(0.00120637 1.65764e-24 -2.51346e-08 1.65764e-24 0.000603186 -6.9364e-29 -2.51346e-08 -6.9364e-29 0.000603186)
(0.00120637 -1.61433e-24 -2.41662e-08 -1.61433e-24 0.000603186 8.50919e-29 -2.41662e-08 8.50917e-29 0.000603186)
(0.00120637 3.6309e-25 -2.33639e-08 3.6309e-25 0.000603186 -3.38068e-29 -2.33639e-08 -3.38065e-29 0.000603186)
(0.00120637 -8.90358e-25 -2.24623e-08 -8.90358e-25 0.000603186 2.75852e-29 -2.24623e-08 2.75853e-29 0.000603186)
(0.00120637 -1.98638e-25 -2.162e-08 -1.98638e-25 0.000603186 1.86221e-29 -2.162e-08 1.86219e-29 0.000603186)
(0.00120637 -6.09897e-25 -2.07423e-08 -6.09897e-25 0.000603186 3.18153e-29 -2.07423e-08 3.18157e-29 0.000603186)
(0.00120637 -3.47889e-25 -1.98858e-08 -3.47889e-25 0.000603186 -3.48065e-29 -1.98858e-08 -3.48065e-29 0.000603186)
(0.00120637 -6.15326e-25 -1.90165e-08 -6.15326e-25 0.000603186 8.98057e-30 -1.90165e-08 8.98047e-30 0.000603186)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0.00120637 -3.98963e-24 -2.58255e-08 -3.98963e-24 0.000603186 1.73007e-28 -2.58255e-08 1.73007e-28 0.000603186);
    }
    right
    {
        type            calculated;
        value           uniform (0.00120637 3.4706e-24 2.58255e-08 3.4706e-24 0.000603186 1.50895e-28 2.58255e-08 1.50895e-28 0.000603186);
    }
    beam
    {
        type            empty;
        value           nonuniform List<tensor> 0();
    }
}


// ************************************************************************* //
